proyecto Arquitectura/stress-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up - Calentamiento"
    - duration: 120
      arrivalRate: 10
      name: "Sustained load - Carga sostenida"
    - duration: 60
      arrivalRate: 20
      name: "High load - Carga alta"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Test API Endpoints - Imperial Luxury Cars"
    flow:
      # 1. Health Check
      - get:
          url: "/"
          expect:
            - statusCode: 200
      
      # 2. Listar todos los vehículos
      - get:
          url: "/api/cars"
          expect:
            - statusCode: 200
            - contentType: json
      
      # 3. Ver detalle de un vehículo (puede no existir)
      - get:
          url: "/api/cars/{{ $randomString() }}"
          expect:
            - statusCode: [200, 404]
      
      # 4. Login de administrador
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@imperialluxury.com"
            password: "Admin123!"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
      
      # 5. Listar mis vehículos (autenticado)
      - get:
          url: "/api/cars/my"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "authToken"
          expect:
            - statusCode: 200
      
      # 6. Obtener estadísticas (admin)
      - get:
          url: "/api/stats"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "authToken"
          expect:
            - statusCode: [200, 403]
      
      # 7. Enviar mensaje de contacto
      - post:
          url: "/api/contact"
          json:
            name: "Test User {{ $randomString() }}"
            email: "test{{ $randomNumber(1000,9999) }}@test.com"
            phone: "555-{{ $randomNumber(1000,9999) }}"
            message: "Mensaje de prueba de estrés - Artillery"
          expect:
            - statusCode: 201
      
      # Simular tiempo de pensamiento de usuario real (1-3 segundos)
      - think: 1-3